Revit 2027 API
MultiReferenceAnnotationOptions Constructor
 Create an instance of Multi-Reference Annotation Options set with default values.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MultiReferenceAnnotationOptions(
	MultiReferenceAnnotationType multiReferenceAnnotationType
)
Public Sub New (
	multiReferenceAnnotationType As MultiReferenceAnnotationType
)
public:
MultiReferenceAnnotationOptions(
	MultiReferenceAnnotationType^ multiReferenceAnnotationType
)
new :
        multiReferenceAnnotationType : MultiReferenceAnnotationType -> MultiReferenceAnnotationOptions
Parameters
multiReferenceAnnotationType MultiReferenceAnnotationType
 The MultiReferenceAnnotationType to be used by the new MultiReferenceAnnotation.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MultiReferenceAnnotationOptions Class
Autodesk.Revit.DB Namespace